; domain
(define
    (domain cube3)
    (:requirements :strips :adl :typing :conditional-effects )
    (:predicates
        (cube1 ?x ?y ?z)
        (cube2 ?x ?y ?z)
        (cube3 ?x ?y ?z)
        (cube4 ?x ?y ?z)
        (cube5 ?x ?y ?z)
        (cube6 ?x ?y ?z)
        (cube7 ?x ?y ?z)
        (cube8 ?x ?y ?z)
        (edge12 ?y ?z)
        (edge13 ?x ?z)
        (edge15 ?x ?y)
        (edge26 ?x ?y)
        (edge24 ?x ?z)
        (edge48 ?x ?y)
        (edge34 ?y ?z)
        (edge37 ?x ?y)
        (edge56 ?y ?z)
        (edge57 ?x ?z)
        (edge68 ?x ?z)
        (edge78 ?y ?z)
    )

    (:action R
    :effect
        (and
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube7 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube8 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube6 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube5 ?y ?x ?z))))

            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge78 ?x ?z))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge68 ?y ?z))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge56 ?x ?z))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge57 ?y ?z))))

        )
    )

    (:action R2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube8 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube6 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube5 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube7 ?x ?y ?z))))

            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge68 ?x ?z))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge56 ?y ?z))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge57 ?x ?z))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge78 ?y ?z))))

        )
    )

    (:action Rrev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube6 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube8 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube7 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube5 ?y ?x ?z))))

            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge56 ?x ?z))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge57 ?y ?z))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge78 ?x ?z))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge68 ?y ?z))))

        )
    )

    (:action L
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) 
                (and (not (cube1 ?x ?y ?z)) (cube2 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) 
                (and (not (cube3 ?x ?y ?z)) (cube1 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) 
                (and (not (cube4 ?x ?y ?z)) (cube3 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) 
                (and (not (cube2 ?x ?y ?z)) (cube4 ?y ?x ?z))))

            (forall (?x ?z) (when (edge13 ?x ?z) 
                (and (not (edge13 ?x ?z)) (edge12 ?x ?z))))
            (forall (?y ?z) (when (edge34 ?y ?z) 
                (and (not (edge34 ?y ?z)) (edge13 ?y ?z))))
            (forall (?x ?z) (when (edge24 ?x ?z) 
                (and (not (edge24 ?x ?z)) (edge34 ?x ?z))))
            (forall (?y ?z) (when (edge12 ?y ?z) 
                (and (not (edge12 ?y ?z)) (edge24 ?y ?z))))

        )
    )

    (:action L2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube4 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube2 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube1 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube3 ?x ?y ?z))))

            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge24 ?x ?z))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge12 ?y ?z))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge13 ?x ?z))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge34 ?y ?z))))

        )
    )

    (:action Lrev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube3 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube4 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube2 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube1 ?y ?x ?z))))

            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge34 ?x ?z))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge24 ?y ?z))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge12 ?x ?z))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge13 ?y ?z))))

        )
    )

    (:action D
    :effect
        (and
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube6 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube8 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube4 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube2 ?x ?z ?y))))

            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge68 ?x ?y))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge48 ?x ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge24 ?x ?y))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge26 ?x ?z))))

        )
    )

    (:action D2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube8 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube4 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube2 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube6 ?x ?y ?z))))

            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge48 ?x ?y))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge24 ?x ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge26 ?x ?y))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge68 ?x ?z))))

        )
    )

    (:action Drev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube4 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube8 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube6 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube2 ?x ?z ?y))))

            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge24 ?x ?y))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge26 ?x ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge68 ?x ?y))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge48 ?x ?z))))
        )
    )

    (:action U
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube3 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube1 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube5 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube7 ?x ?z ?y))))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge13 ?x ?y))))
            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge15 ?x ?z))))
            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge57 ?x ?y))))
            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge37 ?x ?z))))
        )
    )

    (:action U2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube7 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube3 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube1 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube5 ?x ?y ?z))))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge37 ?x ?y))))
            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge13 ?x ?z))))
            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge15 ?x ?y))))
            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge57 ?x ?z))))
        )
    )

    (:action Urev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube5 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube7 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube3 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube1 ?x ?z ?y))))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge57 ?x ?y))))
            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge37 ?x ?z))))
            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge13 ?x ?y))))
            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge15 ?x ?z))))
        )
    )

    (:action F
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube5 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube6 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube2 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube1 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge56 ?y ?x))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge26 ?z ?y))))
            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge12 ?y ?x))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge15 ?z ?y))))

        )
    )

    (:action F2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube6 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube2 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube1 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube5 ?x ?y ?z) )))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge26 ?x ?y))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge12 ?y ?z))))
            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge15 ?x ?y))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge56 ?y ?z))))

        )
    )

    (:action Frev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube2 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube6 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube5 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube1 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge12 ?y ?x))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge15 ?z ?y))))
            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge56 ?y ?x))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge26 ?z ?y))))

        )
    )

    (:action B
    :effect
        (and
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube4 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube3 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube7 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube8 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge34 ?y ?x))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge37 ?z ?y))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge78 ?y ?x))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge48 ?z ?y))))
        )
    )

    (:action B2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube8 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube4 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube3 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube7 ?x ?y ?z) )))

            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge48 ?x ?y))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge34 ?y ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge37 ?x ?y))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge78 ?y ?z))))
        )
    )

    (:action Brev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube7 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube8 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube4 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube3 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge78 ?y ?x))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge48 ?z ?y))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge34 ?y ?x))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge37 ?z ?y))))
        )
    )

)

; problem
(define
    (problem problem_9_7)
    (:domain cube3)
    (:objects Y W B G O R)
    (:init
 (cube1 W R G)
(cube2 R B W)
(cube3 O B Y)
(cube4 G R Y)
(cube5 G O Y)
(cube6 G O W)
(cube7 O B W)
(cube8 Y B R)
(edge12 O G)
(edge13 W G)
(edge15 B W)
(edge24 O Y)
(edge26 G R)
(edge34 Y R)
(edge37 O B)
(edge48 B Y)
(edge56 W R)
(edge57 Y G)
(edge68 O W)
(edge78 B R)
        
    )
    (:goal
        (and
            (cube1 R W B)
            (cube2 O W B)
            (cube3 R Y B)
            (cube4 O Y B)
            (cube5 R W G)
            (cube6 O W G)
            (cube7 R Y G)
            (cube8 O Y G)

            (edge12 W B)
            (edge24 O B)
            (edge34 Y B)
            (edge13 R B)

            (edge15 R W)
            (edge26 O W)
            (edge48 O Y)
            (edge37 R Y)

            (edge56 W G)
            (edge68 O G)
            (edge78 Y G)
            (edge57 R G)
 
        )
    )
)

; plan
1. (f)
   deleted: (cube1 w r g) (cube5 g o y) (cube6 g o w) (cube2 r b w) (edge15 b w) (edge56 w r) (edge26 g r) (edge12 o g)
   added: (cube5 g r w) (cube6 y o g) (cube2 w o g) (cube1 w b r) (edge56 w b) (edge26 r w) (edge12 r g) (edge15 g o)
   goals met: 0 of 20
2. (urev)
   deleted: (cube1 w b r) (cube5 g r w) (cube7 o b w) (cube3 o b y) (edge15 g o) (edge57 y g) (edge37 o b) (edge13 w g)
   added: (cube5 w r b) (cube7 g w r) (cube3 o w b) (cube1 o y b) (edge57 g o) (edge37 y g) (edge13 o b) (edge15 w g)
   goals met: 0 of 20
3. (urev)
   deleted: (cube1 o y b) (cube5 w r b) (cube7 g w r) (cube3 o w b) (edge15 w g) (edge57 g o) (edge37 y g) (edge13 o b)
   added: (cube5 o b y) (cube7 w b r) (cube3 g r w) (cube1 o b w) (edge57 w g) (edge37 g o) (edge13 y g) (edge15 o b)
   goals met: 0 of 20
4. (brev)
   deleted: (cube3 g r w) (cube7 w b r) (cube8 y b r) (cube4 g r y) (edge37 g o) (edge78 b r) (edge48 b y) (edge34 y r)
   added: (cube7 w r g) (cube8 r b w) (cube4 r b y) (cube3 y r g) (edge78 o g) (edge48 r b) (edge34 y b) (edge37 r y)
   goals met: 2 of 20
5. (frev)
   deleted: (cube1 o b w) (cube2 w o g) (cube6 y o g) (cube5 o b y) (edge15 o b) (edge56 w b) (edge26 r w) (edge12 r g)
   added: (cube2 w b o) (cube6 g o w) (cube5 g o y) (cube1 y b o) (edge12 b o) (edge15 b w) (edge56 w r) (edge26 g r)
   goals met: 2 of 20
6. (frev)
   deleted: (cube1 y b o) (cube2 w b o) (cube6 g o w) (cube5 g o y) (edge15 b w) (edge56 w r) (edge26 g r) (edge12 b o)
   added: (cube2 o b y) (cube6 o b w) (cube5 w o g) (cube1 y o g) (edge12 w b) (edge15 r w) (edge56 r g) (edge26 o b)
   goals met: 4 of 20
7. (u)
   deleted: (cube1 y o g) (cube5 w o g) (cube7 w r g) (cube3 y r g) (edge15 r w) (edge57 w g) (edge37 r y) (edge13 y g)
   added: (cube3 y g o) (cube1 w g o) (cube5 w g r) (cube7 y g r) (edge13 r w) (edge15 w g) (edge57 r y) (edge37 y g)
   goals met: 2 of 20
8. (u)
   deleted: (cube1 w g o) (cube5 w g r) (cube7 y g r) (cube3 y g o) (edge15 w g) (edge57 r y) (edge37 y g) (edge13 r w)
   added: (cube3 w o g) (cube1 w r g) (cube5 y r g) (cube7 y o g) (edge13 w g) (edge15 r y) (edge57 y g) (edge37 r w)
   goals met: 2 of 20
9. (drev)
   deleted: (cube2 o b y) (cube4 r b y) (cube8 r b w) (cube6 o b w) (edge26 o b) (edge68 o w) (edge48 r b) (edge24 o y)
   added: (cube4 o y b) (cube8 r y b) (cube6 r w b) (cube2 o w b) (edge24 o b) (edge26 o w) (edge68 r b) (edge48 o y)
   goals met: 7 of 20
10. (rrev)
   deleted: (cube5 y r g) (cube6 r w b) (cube8 r y b) (cube7 y o g) (edge57 y g) (edge78 o g) (edge68 r b) (edge56 r g)
   added: (cube6 r y g) (cube8 w r b) (cube7 y r b) (cube5 o y g) (edge56 y g) (edge57 o g) (edge78 r b) (edge68 r g)
   goals met: 7 of 20
11. (rrev)
   deleted: (cube5 o y g) (cube6 r y g) (cube8 w r b) (cube7 y r b) (edge57 o g) (edge78 r b) (edge68 r g) (edge56 y g)
   added: (cube6 y o g) (cube8 y r g) (cube7 r w b) (cube5 r y b) (edge56 o g) (edge57 r b) (edge78 r g) (edge68 y g)
   goals met: 7 of 20
12. (u)
   deleted: (cube1 w r g) (cube5 r y b) (cube7 r w b) (cube3 w o g) (edge15 r y) (edge57 r b) (edge37 r w) (edge13 w g)
   added: (cube3 w g r) (cube1 r b y) (cube5 r b w) (cube7 w g o) (edge13 r y) (edge15 r b) (edge57 r w) (edge37 w g)
   goals met: 7 of 20
13. (u)
   deleted: (cube1 r b y) (cube5 r b w) (cube7 w g o) (cube3 w g r) (edge15 r b) (edge57 r w) (edge37 w g) (edge13 r y)
   added: (cube3 r y b) (cube1 r w b) (cube5 w o g) (cube7 w r g) (edge13 r b) (edge15 r w) (edge57 w g) (edge37 r y)
   goals met: 12 of 20
14. (rrev)
   deleted: (cube5 w o g) (cube6 y o g) (cube8 y r g) (cube7 w r g) (edge57 w g) (edge78 r g) (edge68 y g) (edge56 o g)
   added: (cube6 o w g) (cube8 o y g) (cube7 r y g) (cube5 r w g) (edge56 w g) (edge57 r g) (edge78 y g) (edge68 o g)
   goals met: 20 of 20
